In [2]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [6]:
s =pd.Series(["Alaa","sara","Haya"],index=[1,2,3])
s

1    Alaa
2    sara
3    Haya
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [7]:
# change the indexes
s.index = [11, 12, 13]
s

11    Alaa
12    sara
13    Haya
dtype: object

## Q3: Retrieve First and second elements.

In [8]:
s[:2]

11    Alaa
12    sara
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [11]:
s2=pd.Series(["Sara"],index=[1])
s2
s.append(s2)

C:\Users\Alaa\AppData\Local\Temp\ipykernel_2072\1314014474.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s.append(s2)

11    Alaa
12    sara
13    Haya
1     Sara
dtype: object

In [12]:
s.drop_duplicates()

11    Alaa
12    sara
13    Haya
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [23]:
  
 Stu ={
     'ID':[11 ,22 ,33] ,
     'Name':['Maha','Amal' ,'Sara'] ,
     'GPA':[4 ,4.5 , 3.5]
 }
Stu_=pd.DataFrame(Stu ,columns=['ID','Name','GPA'])
Stu_

IndentationError: unexpected indent (3578430372.py, line 3)

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [17]:
re =pd.read_csv("educ_figdp_1_Data.csv")
re

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [21]:
re.loc[:3]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e

In [22]:
re[:3]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e